# Для списку цілих чисел потрібно знайти суму елементів із парними індексами
# [0-й, 2-й, 4-й ітд], потім перемножити цю суму на останній елемент вхідного
# масиву. Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0.
#
# Пояснення:
# [0, 1, 7, 2, 4, 8] => (0 + 7 + 4) * 8 = 88
# Приклад:
# [1, 3, 5] => 30
# [6] => 36
# [] => 0
#
# Для перевірки коректності роботи Вашого коду використовуйте приклади вище.
# Робити запит на введення даних від користувача не потрібно.


def func(my_list):
    range(0, len(my_list), 2)

    if len(my_list) == 0:
        return(0)
    else:
        sum = 0
        for i in range(0, len(my_list), 2):
            sum = sum + my_list[i]
            sum * my_list[-1]

        return sum * my_list[-1]


print(func([0, 1, 7, 2, 4, 8]))
print(func([1, 3, 5]))
print(func([6]))
print(func([]))
